{
  "speakers": [
    {
      "time": "Talk",
      "name": "Josefine Schaefer",
      "info": "GDE Web technologies, Developer Relations Engineer at Storyblok",
      "talkName": "Beyond Compliance: Testing for a more Accessible Web",
      "talkInfo": "You want to go beyond roughly meeting guidelines but actually create products that cater a large audience and their needs? To not only fulfill requirements but actually create mindful content & empathic code? Anybody working in tech has the responsibility to provide an inclusive, accessible experience. Let's dive into web accessibility best practices, testing & auditing strategies to take your project to the next level. ",
      "imgSrc": "/speaker-photos/Josefine.png"
    },
    {
      "time": "Talk",
      "name": "Medhat Dawoud",
      "info": "Senior Software Engineer @ Miro, GDE Web Technologies",
      "talkName": "Embrace the web performance budget rituals",
      "talkInfo": "In this talk I will use the dental metaphor in order to introduce the performance budgets just like brushing teeth everyday to keep them clean and healthy you should do the same for your website by setting a performance budget and check it in every pull request in your pipelines, the target audience is mid-level to advanced, I will start by the example of the tooth decay and cleaning them then brushing them everyday as the dentist advice, then explain decay as the performance issue and performance budgeting is like the toothpaste and go from here with the different techniques that developers can do in order to prevent any loss in the performance wins they made.",
      "imgSrc": "/speaker-photos/Medhat.jpeg"
    },
    {
      "time": "Talk",
      "name": "Nicolas Frizzarin",
      "info": "GDE Web technologies, Developer Advocate and Senior Staff Engineer @ Sfeir Luxembourg",
      "talkName": "The digital age of web hydrations",
      "talkInfo": "Hydration is a very large concept which is quite difficult to understand and apply. In this talk, you will get to know what web hydration really is and the different kinds of web hydration that are applicable for different use cases.",
      "imgSrc": "/speaker-photos/Nicolas.jpg"
    },
    {
      "time": "Talk",
      "name": "Tomislav Bronzin",
      "info": "CXO – Chief eXcitement Officer @ CITUS",
      "talkName": "Why do we need middleware for the (G)AI",
      "talkInfo": "Almost every day, new (generative) artificial intelligence services are emerging around the world. Wouldn't it be great if we had something to help us connect our apps to existing or new (G)AI services? This lecture describes how the middleware platform could be a solution to more easily catch up with the different APIs of existing and new services that are emerging.",
      "imgSrc": "/speaker-photos/Tomislav.jpeg"
    },
    {
      "time": "Talk",
      "name": "Arian Stipić",
      "info": "Strategic IT Consultant @ CITUS",
      "talkName": "Why do we need middleware for the (G)AI",
      "talkInfo": "Almost every day, new (generative) artificial intelligence services are emerging around the world. Wouldn't it be great if we had something to help us connect our apps to existing or new (G)AI services? This lecture describes how the middleware platform could be a solution to more easily catch up with the different APIs of existing and new services that are emerging.",
      "imgSrc": "/speaker-photos/Arian.jpeg"
    },
    {
      "time": "Talk",
      "name": "Henry Lim",
      "info": "GDE Web technologies",
      "talkName": "Chrome DevTools LIVE LIVE LIVE",
      "talkInfo": "Chrome DevTools is getting more and more powerful in the past few years. In this session, Henry will takes us through a tour of all the interesting, useful, as well as rarely-known features of DevTools in the form of live demo. Furthermore, he will also live demo the very first version of DevTools, DevTools behind-the-scene, and tips on contributing to DevTools.",
      "imgSrc": "/speaker-photos/Henry.png"
    },
    {
      "time": "Talk",
      "name": "Guillermo Rodas",
      "info": "GDE Web technologies, Senior Full-stack Engineer at EQT Group @ Motherbrain",
      "talkName": " WebAuth and Passkeys: The future of authentication",
      "talkInfo": "In the face of digital threats, strong, easy-to-use authentication is key. 'WebAuth and Passkeys: The future of authentication' examines WebAuth and Passkeys, their constraints, user experience effects, and cybersecurity impacts. Discover why these innovations could revolutionize online authentication.",
      "imgSrc": "/speaker-photos/Guilermo.JPG"
    },
    {
      "time": "Talk",
      "name": "Balram Chavan",
      "info": "GDE Web technologies, Architect, @ Boehringer Ingelheim",
      "talkName": "Unleashing the Potential of AI Tools in Web Development ",
      "talkInfo": "Embark on a journey that explores the seamless synergy of web development and cutting-edge AI capabilities. Discover how AI enhances code quality, testing precision, and offers insights into performance optimization.",
      "imgSrc": "/speaker-photos/Balram.png"
    },
    {
      "time": "Talk",
      "name": "Himanshu Singh",
      "info": "GDE Android and Kotlin, Senior Android Engineer @ NordVPN",
      "talkName": "Elevating app performance",
      "talkInfo": "With apps being developed at a rapid pace for diverse locales and users, it is crucial to continuously enhance app performance to provide an exceptional user experience. This talk will focus on various strategies to improve app performance and empower developers to create high-performing apps.",
      "imgSrc": "/speaker-photos/Himanshu.jpg"
    },
    {
      "time": "Talk",
      "name": "Matthias Geisler",
      "info": "Software Engineer @ LichtBlick SE",
      "talkName": "TDD for Kotlin (and for Beginners)",
      "talkInfo": "This talk will give a (brief) intro into TDD (with Kotlin), so that people lose their fear to try it themselves. Ever wondered what TDD is or 'how' you can use it? You think you cannot TDD projects in a reasonable time? You doubt the value of testing in any case. Well let me bring you the good word of TDD and what wonders it can for you!",
      "imgSrc": "/speaker-photos/Matthias.jpg"
    },
    {
      "time": "Talk",
      "name": "Vasilika Klimova",
      "info": "Developer Relations Engineer @ Kadena, GDE",
      "talkName": "Happy Healthy Team",
      "talkInfo": "How not to go crazy when you have just 2 weeks before the release, and the design is not yet fully ready? What if the important developers leave the team before the release? Let’s talk about how to build processes in a team to have a self-managing team with a healthy environment.",
      "imgSrc": "/speaker-photos/Vasilika.jpg"
    },
    {
      "time": "Talk",
      "name": "Martin Jagodic",
      "info": "Maintainer at Decap CMS",
      "talkName": "Unleashing the Power of Git-Based Content Management Systems",
      "talkInfo": "If you’re starting a small blog or if you’re scaling up an enterprise website, a headless Git-based CMS could be the content management solution you’re looking for. At this session, discover how storing your content with your code can speed up, simplify, and streamline your workflow and how making content developer-first makes everyone happier to contribute.",
      "imgSrc": "/speaker-photos/Martin.png"
    },
    {
      "time": "Panel",
      "name": "Filip Babić",
      "info": "Mobile team lead @ Teltech, Community lead @ GDG Osijek",
      "talkName": "Host of Management panel discussion",
      "talkInfo": "In this panel discussion, we will cover important topics, such as: How is management different today, vs 5 or 10 years ago?, Should a manager also be a leader and a coach?, Dealing with change in companies, The Difficulty of keping people around and many more!",
      "imgSrc": "/speaker-photos/Filip.jpeg"
    },
    {
      "time": "Panel",
      "name": "Sandro Lovnički",
      "info": "Flutterer @Friendly Fire, Community lead @ GDG Zagreb and @ Flutter Croatia ",
      "talkName": "Host of Open Source panel discussion",
      "talkInfo": "In this panel discussion, we will cover important topics, such as: Commercial Open Source, Relationship between OS and companies, maintainer responsibilites, Community relations and building community from the ground up, why go OS and many more!",
      "imgSrc": "/speaker-photos/Sandro.jpeg"
    },
    {
      "time": "Panel",
      "name": "Petyo Ivanov",
      "info": "Full-time OS author and developer  @ mdxeditor.dev @ virtuoso.dev",
      "talkName": "Open Source panel discussion",
      "talkInfo": "A prolific GitHub star collector, Petyo is currently exploring the options of developing profitable bootstrapped business models with an open-source core.",
      "imgSrc": "/speaker-photos/Petyo.jpg"
    },
    {
      "time": "Talk",
      "name": "Boris Martinović",
      "info": "Software enginneer @ Euroherc Insurance, Community lead @ GDG Zagreb",
      "talkName": "From Punch Cards to Predictive Coding",
      "talkInfo": "We will go through the history of development workflow and how it could change in the near future. First, we will go through some of significant eras and advantages that were gained with incorporating new tech or processes. Afterwards, we will talk about how development workflows work now compared to before. Finally, we will be focusing on AI. More specifically, how AI could change our working and learning processes and compare this to some of more radical changes that happened before.",
      "imgSrc": "/speaker-photos/Boris.jpg"
    },
    {
      "time": "Talk",
      "name": "Artem Nikulchenko",
      "info": "Chief software architect @ Teamwork Commerce",
      "talkName": "Hidden Gems of BigQuery",
      "talkInfo": "BigQuery is amazing It is one of my favorite tools within Google Cloud. Luckily, it looks like Google feels the same and, to the joy of BigQuery fans, keeps adding new features there. No matter how long I have been working with BigQuery, there is always something new I discover once in a while. In this talk, we will start by talking about BigQuery in general and its internal architecture, then talk about the ELT process and tools around BigQuery to facilitate this process, and then move to highlight several amazing BQ features, including three ways to do change tracking in BigQuery, machine learning, indexing, and transactions.",
      "imgSrc": "/speaker-photos/Artem.jpeg"
    }
  ]
}
