{
  "speakers": [
    {
      "time": "Web",
      "name": "Josefine Schäfer",
      "info": "GDE Web technologies, Developer Relations Engineer at Storyblok",
      "talkName": "Beyond Compliance: Testing for a more Accessible Web",
      "talkInfo": "You want to go beyond roughly meeting guidelines but actually create products that cater a large audience and their needs? To not only fulfill requirements but actually create mindful content & empathic code? Anybody working in tech has the responsibility to provide an inclusive, accessible experience. Let's dive into web accessibility best practices, testing & auditing strategies to take your project to the next level. ",
      "imgSrc": "/speaker-photos/Josefine.png"
    },
    {
      "time": "Web",
      "name": "Nicolas Frizzarin",
      "info": "GDE Web technologies, Developer Advocate and Senior Staff Engineer @ Sfeir Luxembourg",
      "talkName": "The digital age of web hydration, understanding types of hydration for web use ",
      "talkInfo": "Hydration is a very large concept which is quite difficult to understand and apply. In this talk, you will get to know what web hydration really is and the different kinds of web hydration that are applicable for different use cases.",
      "imgSrc": "/speaker-photos/Nicolas.jpg"
    },
    {
      "time": "Web",
      "name": "Henry Lim",
      "info": "GDE Web technologies",
      "talkName": "Chrome DevTools LIVE LIVE LIVE",
      "talkInfo": "Chrome DevTools is getting more and more powerful in the past few years. In this session, Henry will takes us through a tour of all the interesting, useful, as well as rarely-known features of DevTools in the form of live demo. Furthermore, he will also live demo the very first version of DevTools, DevTools behind-the-scene, and tips on contributing to DevTools.",
      "imgSrc": "/speaker-photos/Henry.png"
    },
    {
      "time": "AI / Web",
      "name": "Balram Chavan",
      "info": "GDE Web technologies, Architect, @ Boehringer Ingelheim",
      "talkName": "Unleashing the Potential of AI Tools in Web Development ",
      "talkInfo": "Embark on a journey that explores the seamless synergy of web development and cutting-edge AI capabilities. Discover how AI enhances code quality, testing precision, and offers insights into performance optimization.",
      "imgSrc": "/speaker-photos/Balram.png"
    },
    {
      "time": "Panel",
      "name": "Filip Babić",
      "info": "Mobile team lead @ Teltech, Community lead @ GDG Osijek",
      "talkName": "Host of Management panel discussion",
      "talkInfo": "In this panel discussion, we will cover important topics, such as: How is management different today, vs 5 or 10 years ago?, Should a manager also be a leader and a coach?, Dealing with change in companies, The Difficulty of keping people around and many more!",
      "imgSrc": "/speaker-photos/Filip.jpeg"
    },
    {
      "time": "Panel",
      "name": "Sandro Lovnički",
      "info": "Flutterer @Friendly Fire, Community lead @ GDG Zagreb and @ Flutter Croatia ",
      "talkName": "Host of Open Source panel discussion",
      "talkInfo": "In this panel discussion, we will cover important topics, such as: Commercial Open Source, Relationship between OS and companies, maintainer responsibilites, Community relations and building community from the ground up, why go OS and many more!",
      "imgSrc": "/speaker-photos/Sandro.jpeg"
    },
    {
      "time": "AI",
      "name": "Boris Martinović",
      "info": "Software enginneer @ Euroherc Insurance, Community lead @ GDG Zagreb",
      "talkName": "From Punch Cards to Predictive Coding",
      "talkInfo": "We will go through the history of development workflow and how it could change in the near future. First, we will go through some of significant eras and advantages that were gained with incorporating new tech or processes. Afterwards, we will talk about how development workflows work now compared to before. Finally, we will be focusing on AI. More specifically, how AI could change our working and learning processes and compare this to some of more radical changes that happened before.",
      "imgSrc": "/speaker-photos/Boris.jpg"
    },
    {
      "time": "Cloud",
      "name": "Artem Nikulchenko",
      "info": "Chief software architect @ Teamwork Commerce",
      "talkName": "Hidden Gems of Bigquery",
      "talkInfo": "BigQuery is amazing. It is one of my favorite tools within Google Cloud. Luckily, it looks like Google feels the same and, to the joy of BigQuery fans, keeps adding new features there. No matter how long I have been working with BigQuery, there is always something new I discover once in a while. In this talk, we will start by talking about BigQuery in general and its internal architecture, then talk about the ELT process and tools around BigQuery to facilitate this process, and then move to highlight several amazing BQ features, including three ways to do change tracking in BigQuery, machine learning, indexing, and transactions.",
      "imgSrc": "/speaker-photos/Artem.jpeg"
    }
  ]
}
